tutorial/counterFlowFlame2D/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 2;

method          scotch;


hierarchicalCoeffs
{
    n   (2 2 2);
}

multiLevelCoeffs
{
    nodes
    {
        numberOfSubdomains  64;
        method              scotch;
        coeffs
        {
            n   (4 4 4);
        }
    }
    cpus
    {
        numberOfSubdomains  2;
        method              scotch;
    }
    cores
    {
        numberOfSubdomains  32;
        method              scotch;
        coeffs
        {
            n   (4 4 2);
        }
    }
}

// ************************************************************************* //
